<template>
  <div class="content">
      <span>
          Vue (произносится /vjuː/, примерно как view) — это прогрессивный фреймворк для создания пользовательских интерфейсов. В отличие от фреймворков-монолитов, Vue создан пригодным для постепенного внедрения. Его ядро в первую очередь решает задачи уровня представления (view), что упрощает интеграцию с другими библиотеками и существующими проектами. С другой стороны, Vue полностью подходит и для создания сложных одностраничных приложений (SPA, Single-Page Applications), если использовать его совместно с современными инструментами и дополнительными библиотеками.
            Если вы хотите узнать больше о Vue перед тем как начать, мы создали видео с рассказом об основных принципах работы на примере проекта.
      </span>
  </div>
</template>

<script>
export default {

}
</script>

<style>
.content {
    position: relative;
    max-width: 1200px;
    margin: 0 auto;
    margin-top: 120px;
    padding-left: 20px;
}
</style>